; domain
(define (domain alchemy)
  (:requirements :strips :typing)
  
  (:types
      alchemist ingredient container potion - object
  )
  
  (:predicates
    (available ?i - ingredient)
    (has-ingredient ?a - alchemist ?i - ingredient)
    (in ?i - ingredient ?c - container)  
    (mixture-complete ?c - container)    
    (potion-ready ?p - potion ?c - container) 
    (different ?i1 ?i2 - ingredient)
  )
  
  (:action collect-ingredient
    :parameters (?a - alchemist ?i - ingredient)
    :precondition (available ?i)
    :effect (and (has-ingredient ?a ?i) (not (available ?i)))
  )

  (:action add-ingredient
    :parameters (?a - alchemist ?i - ingredient ?c - container)
    :precondition (has-ingredient ?a ?i)
    :effect (and (in ?i ?c) (not (has-ingredient ?a ?i)))
  )
  
  (:action clean-container
    :parameters (?a - alchemist ?c - container ?i - ingredient)
    :precondition (in ?i ?c)
    :effect (not (in ?i ?c))
  )
  
  (:action mix-ingredients
    :parameters (?a - alchemist ?r1 ?r2 ?r3 - ingredient ?c - container)
    :precondition (and (in ?r1 ?c) (in ?r2 ?c) (in ?r3 ?c) (different ?r1 ?r2) (different ?r1 ?r3) (different ?r2 ?r3))
    :effect (and (mixture-complete ?c))
  )
  
  (:action brew-potion
    :parameters (?a - alchemist ?c - container ?p - potion)
    :precondition (mixture-complete ?c)
    :effect (potion-ready ?p ?c)
  )
)

; problem
(define (problem alchemy-p1)
  (:domain alchemy)
  
  (:objects
    herb - ingredient
    mushroom - ingredient
    crystal - ingredient
    alchemist1 - alchemist
    container1 - container
    potion1 - potion
  )
  
  (:init
    ;; The three required ingredients are available.
    (available herb)
    (available mushroom)
    (available crystal)
    (different herb mushroom)
    (different herb crystal)
    (different mushroom crystal)
    (different mushroom herb)
    (different crystal herb)
    (different crystal mushroom)
  )
  
  (:goal
    ;; The goal is for the potion to be brewed in the container.
    (potion-ready potion1 container1)
  )
)

; plan
1. (collect-ingredient alchemist1 herb)
   deleted: (available herb)
   added: (has-ingredient alchemist1 herb)
   goals met: 0 of 1
2. (collect-ingredient alchemist1 mushroom)
   deleted: (available mushroom)
   added: (has-ingredient alchemist1 mushroom)
   goals met: 0 of 1
3. (collect-ingredient alchemist1 crystal)
   deleted: (available crystal)
   added: (has-ingredient alchemist1 crystal)
   goals met: 0 of 1
4. (add-ingredient alchemist1 herb container1)
   deleted: (has-ingredient alchemist1 herb)
   added: (in herb container1)
   goals met: 0 of 1
5. (add-ingredient alchemist1 mushroom container1)
   deleted: (has-ingredient alchemist1 mushroom)
   added: (in mushroom container1)
   goals met: 0 of 1
6. (add-ingredient alchemist1 crystal container1)
   deleted: (has-ingredient alchemist1 crystal)
   added: (in crystal container1)
   goals met: 0 of 1
7. (mix-ingredients alchemist1 herb mushroom crystal container1)
   added: (mixture-complete container1)
   goals met: 0 of 1
8. (brew-potion alchemist1 container1 potion1)
   added: (potion-ready potion1 container1)
   goals met: 1 of 1
